---
type: PipePressureDropData
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 21
tags: [revit-api, class]
---

# PipePressureDropData

`Autodesk.Revit.DB.Plumbing.PipePressureDropData` · Revit 2024 · 21 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | CategoryId | 2014 | `public ElementId CategoryId { get ; }` |
| Property | Coefficient | 2014 | `public double Coefficient { get ; set ; }` |
| Property | Density | 2014 | `public double Density { get ; }` |
| Property | Flow | 2014 | `public double Flow { get ; }` |
| Property | FlowState | 2014 | `public PipeFlowState FlowState { get ; set ; }` |
| Property | Friction | 2014 | `public double Friction { get ; set ; }` |
| Property | FrictionFactor | 2014 | `public double FrictionFactor { get ; set ; }` |
| Property | InsideDiameter | 2014 | `public double InsideDiameter { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | KLevel | 2014 | `public SystemCalculationLevel KLevel { get ; }` |
| Property | Length | 2014 | `public double Length { get ; }` |
| Property | NominalDiameter | 2014 | `public double NominalDiameter { get ; }` |
| Property | OutsideDiameter | 2014 | `public double OutsideDiameter { get ; }` |
| Property | PressureDrop | 2014 | `public double PressureDrop { get ; set ; }` |
| Property | RelativeRoughness | 2014 | `public double RelativeRoughness { get ; set ; }` |
| Property | ReynoldsNumber | 2014 | `public double ReynoldsNumber { get ; set ; }` |
| Property | Roughness | 2014 | `public double Roughness { get ; }` |
| Property | Velocity | 2014 | `public double Velocity { get ; set ; }` |
| Property | VelocityPressure | 2014 | `public double VelocityPressure { get ; set ; }` |
| Property | Viscosity | 2014 | `public double Viscosity { get ; }` |